package main

import (
	"Eino/internal/llm"
	"Eino/internal/server"
	"Eino/internal/utils"
	"log"
)

// 主程序
func main() {
	//神秘启动仪式
	utils.PrintBanner(`
██╗  ██╗ ██████╗ ██╗      ██╗      ██████╗ 
██║  ██║██╔═══██╗██║      ██║     ██╔═══██╗
███████║██║   ██║██║      ██║     ██║   ██║
██╔══██║██║   ██║██║      ██║     ██║   ██║
██║  ██║╚██████╔╝███████╗ ███████╗╚██████╔╝
╚═╝  ╚═╝ ╚═════╝ ╚══════╝ ╚══════╝ ╚═════╝ 

         欢迎启动 Hollow 智能 Agent 🚀
`)

	//模式初始化
	llm.NewOllamaModel()

	r := server.New()
	log.Println("Agent HTTP 服务启动，监听端口 8080")
	if err := r.Run(":8080"); err != nil {
		log.Fatal(err)
	}
}
