package main

import (
	"Eino/internal/llm"
	"Eino/internal/utils"
	"context"

	"log"
)

// 主程序
func main() {
	//神秘启动仪式
	utils.PrintBanner(`
██╗  ██╗ ██████╗ ██╗      ██╗      ██████╗ 
██║  ██║██╔═══██╗██║      ██║     ██╔═══██╗
███████║██║   ██║██║      ██║     ██║   ██║
██╔══██║██║   ██║██║      ██║     ██║   ██║
██║  ██║╚██████╔╝███████╗ ███████╗╚██████╔╝
╚═╝  ╚═╝ ╚═════╝ ╚══════╝ ╚══════╝ ╚═════╝ 

         欢迎启动 Hollow 智能 Agent 🚀
`)

	ctx := context.Background()
	//模式初始化
	llm.NewOllamaModel()

	res, err := llm.OllamaChatModel.RunAgent(ctx, "你好,我想了解一下李白")
	if err != nil {
		log.Fatal(err)
	}
	log.Println("output:", res)
	//utils.Edge_tts(res)
	utils.Win_tts(res)
}
